InformationRegisters/ЗвонкиСбросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗвонкиСбросы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Comment>Дата, когда принято решение по сбросу: или создать задачу или ничего не создавать</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗвонкиСбросы/Ext/ManagerModule.bsl
Функция Добавить(Звонок, ДатаРегистрации, ДатаОбработки = '00010101') Экспорт
	
	Зап = РегистрыСведений.ЗвонкиСбросы.СоздатьМенеджерЗаписи();
	Зап.Сигнатура		= Звонок;
	Зап.ДатаОбработки	= ДатаОбработки;
	Зап.Прочитать();
	Если Зап.Выбран() Тогда
		Возврат "Ошибка: запись уже существует";	
	КонецЕсли;
	
	Зап.Сигнатура		= Звонок;
	Зап.ДатаРегистрации = ДатаРегистрации;
	Попытка
		Зап.Записать();	
	Исключение
		Данные 		= "Звонок = "+Звонок+"; ДатаРегистрации = "+ДатаРегистрации+"; ДатаОбработки = "+ДатаОбработки;
		Комментарий = ОписаниеОшибки(); 
		ЗаписьЖурналаРегистрации("ЗвонкиСбросы.Добавить", УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.ЗвонкиСбросы, Данные, Комментарий);
	КонецПопытки;
	
	Возврат "";

КонецФункции
